Tekla.Structures.Model.SurfaceObject
The SurfaceObject class represents a surface object in the model. Currently this class
only support dynamic surfaces whose geometries are determined by the parts or pours
they associate to. It is not allowed to modify the geometry of a dynamic surface on Open API.
The polymesh setter of this class throws .
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Collections.Generic;
public class Example
{
public void Example1()
{
Point startPointBeam = new Point(0.0, 0.0, 0.0);
Point endPointBeam = new Point(10000.0, 0.0, 0.0);
Beam Beam = new Beam(startPointBeam, endPointBeam)
{
Profile = { ProfileString = "400*400" },
Material = { MaterialString = "Concrete_Undefined" }
};
Beam.Insert();
SurfaceObject surfaceObject = new SurfaceObject();
surfaceObject.Polymesh = CreateSingleFacePolymeshGeometry(
new[]
{
new Vector(    0.0, -200.0, 0.0), // 0
new Vector(10000.0, -200.0, 0.0), // 1
new Vector(10000.0,  200.0, 0.0), // 2
new Vector(    0.0,  200.0, 0.0)  // 3
});
surfaceObject.Father = this.Beam;
surfaceObject.Insert();
}
private static FacetedBrep CreateSingleFacePolymeshGeometry(Vector[] vertices)
{
var outerWires = new int[1][];
outerWires[0] = new int[vertices.Length];
for (int i = 0; i < vertices.Length; i++)
outerWires[0][i] = i;
var innerWires = new Dictionary<int, int[][]> { };
return new FacetedBrep(vertices, outerWires, innerWires);
}
}

Tekla.Structures.Model.SurfaceObject.father
The father object of the surface object.

Tekla.Structures.Model.SurfaceObject.#ctor
Initializes a new instance of the Tekla.Structures.Model.SurfaceObject class.

Tekla.Structures.Model.SurfaceObject.Polymesh
Gets or sets the surface geometry brep.
The polymesh.

Tekla.Structures.Model.SurfaceObject.Class
Gets or sets the class of the surface object.

Tekla.Structures.Model.SurfaceObject.Name
Gets or sets the name of the surface object.

Tekla.Structures.Model.SurfaceObject.CreateHoles
Gets or sets a value indicating whether CreateHoles parameter of the surface object.
true if [create holes]; otherwise, false.

Tekla.Structures.Model.SurfaceObject.Type
Gets or sets the type of the surface object.

Tekla.Structures.Model.SurfaceObject.Father
Gets or sets the father object of the surface object. The father can be set only before the Insert(), otherwise exception is thrown.
Throws System.InvalidOperationException: Thrown when the father is tried to set after Insert().

Tekla.Structures.Model.SurfaceObject.ModelObjectType
Gets the model object type for this instance.

Tekla.Structures.Model.SurfaceObject.Insert
Inserts a new model object. The geometry of the object
needs to be set by using the public Polymesh
function, before calling insert.
Returns: True on success.

Tekla.Structures.Model.SurfaceObject.Select
Selects the model object from the model by the identifier of this instance.
Returns: True on success.

Tekla.Structures.Model.SurfaceObject.Modify
Modifies the existing model object in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.SurfaceObject.Delete
Deletes the model object from the model database.
Returns: True on success.

Tekla.Structures.Model.SurfaceObject.ToStruct(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
converts this instance to a struct.
output:
The output parameter.

Tekla.Structures.Model.SurfaceObject.FromStruct(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Sets the properties of this instance from the struct.
input:
The input parameter.

Tekla.Structures.Model.SurfaceObject.CreateInstanceDelegate(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Invokes the delegate of creating this surface in the model.
surface: The surface.
Returns:
The error code returned from the delegate.
surface the surface polymesh

Tekla.Structures.Model.SurfaceObject.SelectInstanceDelegate(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Invokes the delegate of selecting this surface in the model.
surface: The surface.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.SurfaceObject.ModifyInstanceDelegate(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Invokes the delegate of modifying this surface in the model.
surface: The surface.
Returns:
The error code returned from the delegate.